#include <graphics.h>
#include <stdlib.h>
#include <conio.h>
#include <math.h>
//--------------------------------------------------
//--------------------------------------------------
//-------Использование кода точь-в-точь запрещенно--
//-------Разрешенно использование при нехватке: ----
//-------Времени, знаний, понимания процесса -------
//------------лучше пишите сами---------------------
//--------------------------------------------------
const int widht = 800, hieght = 600; //размеры окна

int main()
{
	int x = -10, y, f2, i = 0; // цифорки
	initwindow(widht, hieght); //рисуем окно
	setcolor(WHITE); //выбираем цвет
	
	moveto(widht/2,0); //курсор
	lineto(widht/2, hieght); //линия
	outtextxy(widht/2 + 5, 100, "Y ^"); //блабла
	
	setcolor(WHITE); //цвет(хочу я так много раз его писать вот и все)
	moveto(0,hieght/2); // курсор
	lineto(widht, hieght/2); //линия
	outtextxy(widht - 50, hieght/2 - 20, "X ->"); //блабла
	
	//формула первая
	
	for (; x <= 10; x++) 
	{
		i = ((abs(x)) % 4); //значение для переодичности - или +
		y = cos(x%2); //функция
		setcolor(WHITE); //цвет
		if(i == 0) //если +
		{
			arc(widht/2 + x*15, hieght/2, 0, 180, 15); //полукруг( больше информации в интернете в методичке нет такой)
			moveto(widht/2 + x*15, hieght/2); //курсор
		}
		else if (i == 2) //если -
		{
			y *= -1; //вот этим инвентированием это и выражается
			arc(widht/2 + x*15, hieght/2, -180, 0, 15); //полукруг
			moveto(widht/2 + x*15, hieght/2); //курсор

		}
	}
	
	outtextxy(widht/2 - 150, hieght/2 - 50, "cos(x)"); //блабла
	
	//костыль
	x = -20;
	y = pow(x,2);
	moveto(widht/2 + x*2, hieght/2 - y);
	//-------
	
	//формула вторая
	for (x = -20; x <= 20; x++) //икс
	{
		y = pow(x,2); //функция
		setcolor(WHITE); //цвет
		lineto(widht/2 + x*2, hieght/2 - y); //линия
		moveto(widht/2 + x*2, hieght/2 - y); //курсор

	}
	
	outtextxy(widht/2 + 50, 50, "pow(x,2)"); //блабла
	
	setfillstyle(1, LIGHTBLUE); //закрашиваем стиль/цвет
	floodfill(widht/2 + 1, hieght/2 - 7.5, WHITE); //тут
	floodfill(widht/2 - 1, hieght/2 - 7.5, WHITE); //и тут
	
	
	getch(); //ждём нажатия
	closegraph(); //ливаем
}
//-----------------------------
//---Иванов К. А. ИП-814 ------
//-----------------------------
